data = input()
d = set(data.lower())
print(' '.join(map(str,sorted(d, key=str.lower))))


<<<<<<< HEAD











# Необходимо написать программу, 
# которая будет считывать со стандартного ввода строку и выводить уникальные символы,
# встретившиеся в этой строке, в лексикографическом порядке по возрастанию.
# Символы из входа нужно приводить к нижнему регистру.
# Символ пробела не нужно учитывать при формировании результата. 
# Выходные символы нужно разделять пробелом.
# Входные данные
# abcabcaaabb12bbbaaa
# Выходные данные
# 1 2 a b c

=======
# Необходимо написать программу, которая будет считывать со стандартного ввода строку и 
# выводить уникальные символы, встретившиеся в этой строке,
#  в лексикографическом порядке по возрастанию. 
#  Символы из входа нужно приводить к нижнему регистру. 
# Символ пробела не нужно учитывать при формировании результата. 
# Выходные символы нужно разделять пробелом.
>>>>>>> 3fb3929a4a59da74d78ef36932e559c85c2d96bb
